# Store casks in the local applications directory.
cask_args appdir: "~/Applications", require_sha: true

# Install system programs.
brew "asdf"
brew "curl"
brew "git"
brew "pandoc"
brew "postgresql"
brew "ripgrep"
brew "sqlite3"
brew "wget"
brew "youtube-dl"

# Install GUI programs.
cask "basictex"
cask "emacs"
cask "dash"
cask "discord"
cask "figma"
cask "karabiner-elements"
cask "spotify"
cask "1password"
